app/views/deals/new.html.erb

SELECT "categories".* FROM "categories"
---
      <%= form.label :category, class: 'form-label' %>
      <%= select_tag :category, options_for_select(@categories.map { |category| [category.name, category.id] }),
      { prompt: 'Select Category', required: true, class: 'form-select' } %>