app/controllers/categories_controller.rb

  def index
    @user = current_user
    @categories = @user.categories.includes(:deals)
---
SELECT "deals".* FROM "deals" WHERE "deals"."id" IN ($1, $2)  [["id", 31], ["id", 32]]

  def create
    @user = current_user
    @category = @user.categories.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("author_id", "name", "icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 10], ["name", "Travel"], ["icon", "https://source.unsplash.com/1"], ["created_at", "2023-11-21 16:16:29.415374"], ["updated_at", "2023-11-21 16:16:29.415374"]]

  def show
    @user = current_user
    # The `includes` method is used to avoid the N+1 query problem.
    @category = @user.categories.includes(:deals).find(params[:id])
---
SELECT "deals".* FROM "deals" WHERE "deals"."id" IN ($1, $2, $3)  [["id", 35], ["id", 38], ["id", 39]]