app/controllers/deals_controller.rb

  def new
    @deal = Deal.new
    @categories = Category.where(author: current_user)
---
SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["author_id", 10], ["id", 23], ["LIMIT", 1]]

  def create
    @deal = Deal.new(deal_params)
    @deal.author = current_user

    # it contains a many to many relationship and joins table between deals and categories
    @deal.categories = Category.where(id: params[:category])

    if @deal.save
      redirect_to category_path(Category.find_by(id: params[:category]))
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1  [["id", 19]]
INSERT INTO "deals" ("author_id", "name", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 10], ["name", "bus fare"], ["amount", 14], ["created_at", "2023-11-22 03:17:33.452118"], ["updated_at", "2023-11-22 03:17:33.452118"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]