app/views/categories/index.html.erb

    <!-- calculate total amount spent on this category -->
    <p>Total Spent: $<%= category.deals.sum(:amount) %></p>
---
SELECT SUM("deals"."amount") FROM "deals" INNER JOIN "deals_categories" ON "deals"."id" = "deals_categories"."deal_id" WHERE "deals_categories"."category_id" = $1  [["category_id", 19]]