app/views/categories/show.html.erb

SELECT "deals".* FROM "deals" INNER JOIN "deals_categories" ON "deals"."id" = "deals_categories"."deal_id" WHERE "deals_categories"."category_id" = $1 ORDER BY "deals"."created_at" DESC  [["category_id", 23]]
SELECT SUM("deals"."amount") FROM "deals" INNER JOIN "deals_categories" ON "deals"."id" = "deals_categories"."deal_id" WHERE "deals_categories"."category_id" = $1  [["category_id", 19]]
---
  <strong>Total Spent:</strong>
  $<%= @category.deals.sum(:amount) %>

SELECT "deals".* FROM "deals" INNER JOIN "deals_categories" ON "deals"."id" = "deals_categories"."deal_id" WHERE "deals_categories"."category_id" = $1 ORDER BY "deals"."created_at" DESC  [["category_id", 23]]
---

<% if @category.deals.any? %>